LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* FTDM_OUT29  - Registers (IC 1) */
#define REG_FTDM_OUT29_IC_1_ADDR                  0xF39D
#define REG_FTDM_OUT29_IC_1_BYTE                  2
#define REG_FTDM_OUT29_IC_1_VALUE                 0x0

/* FTDM_OUT30  - Registers (IC 1) */
#define REG_FTDM_OUT30_IC_1_ADDR                  0xF39E
#define REG_FTDM_OUT30_IC_1_BYTE                  2
#define REG_FTDM_OUT30_IC_1_VALUE                 0x0

/* FTDM_OUT31  - Registers (IC 1) */
#define REG_FTDM_OUT31_IC_1_ADDR                  0xF39F
#define REG_FTDM_OUT31_IC_1_BYTE                  2
#define REG_FTDM_OUT31_IC_1_VALUE                 0x0

/* FTDM_OUT32  - Registers (IC 1) */
#define REG_FTDM_OUT32_IC_1_ADDR                  0xF3A0
#define REG_FTDM_OUT32_IC_1_BYTE                  2
#define REG_FTDM_OUT32_IC_1_VALUE                 0x0

/* FTDM_OUT33  - Registers (IC 1) */
#define REG_FTDM_OUT33_IC_1_ADDR                  0xF3A1
#define REG_FTDM_OUT33_IC_1_BYTE                  2
#define REG_FTDM_OUT33_IC_1_VALUE                 0x0

/* FTDM_OUT34  - Registers (IC 1) */
#define REG_FTDM_OUT34_IC_1_ADDR                  0xF3A2
#define REG_FTDM_OUT34_IC_1_BYTE                  2
#define REG_FTDM_OUT34_IC_1_VALUE                 0x0

/* FTDM_OUT35  - Registers (IC 1) */
#define REG_FTDM_OUT35_IC_1_ADDR                  0xF3A3
#define REG_FTDM_OUT35_IC_1_BYTE                  2
#define REG_FTDM_OUT35_IC_1_VALUE                 0x0

/* FTDM_OUT36  - Registers (IC 1) */
#define REG_FTDM_OUT36_IC_1_ADDR                  0xF3A4
#define REG_FTDM_OUT36_IC_1_BYTE                  2
#define REG_FTDM_OUT36_IC_1_VALUE                 0x0

/* FTDM_OUT37  - Registers (IC 1) */
#define REG_FTDM_OUT37_IC_1_ADDR                  0xF3A5
#define REG_FTDM_OUT37_IC_1_BYTE                  2
#define REG_FTDM_OUT37_IC_1_VALUE                 0x0

/* FTDM_OUT38  - Registers (IC 1) */
#define REG_FTDM_OUT38_IC_1_ADDR                  0xF3A6
#define REG_FTDM_OUT38_IC_1_BYTE                  2
#define REG_FTDM_OUT38_IC_1_VALUE                 0x0

/* FTDM_OUT39  - Registers (IC 1) */
#define REG_FTDM_OUT39_IC_1_ADDR                  0xF3A7
#define REG_FTDM_OUT39_IC_1_BYTE                  2
#define REG_FTDM_OUT39_IC_1_VALUE                 0x0

/* FTDM_OUT40  - Registers (IC 1) */
#define REG_FTDM_OUT40_IC_1_ADDR                  0xF3A8
#define REG_FTDM_OUT40_IC_1_BYTE                  2
#define REG_FTDM_OUT40_IC_1_VALUE                 0x0

/* FTDM_OUT41  - Registers (IC 1) */
#define REG_FTDM_OUT41_IC_1_ADDR                  0xF3A9
#define REG_FTDM_OUT41_IC_1_BYTE                  2
#define REG_FTDM_OUT41_IC_1_VALUE                 0x0

/* FTDM_OUT42  - Registers (IC 1) */
#define REG_FTDM_OUT42_IC_1_ADDR                  0xF3AA
#define REG_FTDM_OUT42_IC_1_BYTE                  2
#define REG_FTDM_OUT42_IC_1_VALUE                 0x0

/* FTDM_OUT43  - Registers (IC 1) */
#define REG_FTDM_OUT43_IC_1_ADDR                  0xF3AB
#define REG_FTDM_OUT43_IC_1_BYTE                  2
#define REG_FTDM_OUT43_IC_1_VALUE                 0x0

/* FTDM_OUT44  - Registers (IC 1) */
#define REG_FTDM_OUT44_IC_1_ADDR                  0xF3AC
#define REG_FTDM_OUT44_IC_1_BYTE                  2
#define REG_FTDM_OUT44_IC_1_VALUE                 0x0

/* FTDM_OUT45  - Registers (IC 1) */
#define REG_FTDM_OUT45_IC_1_ADDR                  0xF3AD
#define REG_FTDM_OUT45_IC_1_BYTE                  2
#define REG_FTDM_OUT45_IC_1_VALUE                 0x0

/* FTDM_OUT46  - Registers (IC 1) */
#define REG_FTDM_OUT46_IC_1_ADDR                  0xF3AE
#define REG_FTDM_OUT46_IC_1_BYTE                  2
#define REG_FTDM_OUT46_IC_1_VALUE                 0x0

/* FTDM_OUT47  - Registers (IC 1) */
#define REG_FTDM_OUT47_IC_1_ADDR                  0xF3AF
#define REG_FTDM_OUT47_IC_1_BYTE                  2
#define REG_FTDM_OUT47_IC_1_VALUE                 0x0

/* FTDM_OUT48  - Registers (IC 1) */
#define REG_FTDM_OUT48_IC_1_ADDR                  0xF3B0
#define REG_FTDM_OUT48_IC_1_BYTE                  2
#define REG_FTDM_OUT48_IC_1_VALUE                 0x0

/* FTDM_OUT49  - Registers (IC 1) */
#define REG_FTDM_OUT49_IC_1_ADDR                  0xF3B1
#define REG_FTDM_OUT49_IC_1_BYTE                  2
#define REG_FTDM_OUT49_IC_1_VALUE                 0x0

/* FTDM_OUT50  - Registers (IC 1) */
#define REG_FTDM_OUT50_IC_1_ADDR                  0xF3B2
#define REG_FTDM_OUT50_IC_1_BYTE                  2
#define REG_FTDM_OUT50_IC_1_VALUE                 0x0

/* FTDM_OUT51  - Registers (IC 1) */
#define REG_FTDM_OUT51_IC_1_ADDR                  0xF3B3
#define REG_FTDM_OUT51_IC_1_BYTE                  2
#define REG_FTDM_OUT51_IC_1_VALUE                 0x0

/* FTDM_OUT52  - Registers (IC 1) */
#define REG_FTDM_OUT52_IC_1_ADDR                  0xF3B4
#define REG_FTDM_OUT52_IC_1_BYTE                  2
#define REG_FTDM_OUT52_IC_1_VALUE                 0x0

/* FTDM_OUT53  - Registers (IC 1) */
#define REG_FTDM_OUT53_IC_1_ADDR                  0xF3B5
#define REG_FTDM_OUT53_IC_1_BYTE                  2
#define REG_FTDM_OUT53_IC_1_VALUE                 0x0

/* FTDM_OUT54  - Registers (IC 1) */
#define REG_FTDM_OUT54_IC_1_ADDR                  0xF3B6
#define REG_FTDM_OUT54_IC_1_BYTE                  2
#define REG_FTDM_OUT54_IC_1_VALUE                 0x0

/* FTDM_OUT55  - Registers (IC 1) */
#define REG_FTDM_OUT55_IC_1_ADDR                  0xF3B7
#define REG_FTDM_OUT55_IC_1_BYTE                  2
#define REG_FTDM_OUT55_IC_1_VALUE                 0x0

/* FTDM_OUT56  - Registers (IC 1) */
#define REG_FTDM_OUT56_IC_1_ADDR                  0xF3B8
#define REG_FTDM_OUT56_IC_1_BYTE                  2
#define REG_FTDM_OUT56_IC_1_VALUE                 0x0

/* FTDM_OUT57  - Registers (IC 1) */
#define REG_FTDM_OUT57_IC_1_ADDR                  0xF3B9
#define REG_FTDM_OUT57_IC_1_BYTE                  2
#define REG_FTDM_OUT57_IC_1_VALUE                 0x0

/* FTDM_OUT58  - Registers (IC 1) */
#define REG_FTDM_OUT58_IC_1_ADDR                  0xF3BA
#define REG_FTDM_OUT58_IC_1_BYTE                  2
#define REG_FTDM_OUT58_IC_1_VALUE                 0x0

