LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* FTDM_OUT59  - Registers (IC 1) */
#define REG_FTDM_OUT59_IC_1_ADDR                  0xF3BB
#define REG_FTDM_OUT59_IC_1_BYTE                  2
#define REG_FTDM_OUT59_IC_1_VALUE                 0x0

/* FTDM_OUT60  - Registers (IC 1) */
#define REG_FTDM_OUT60_IC_1_ADDR                  0xF3BC
#define REG_FTDM_OUT60_IC_1_BYTE                  2
#define REG_FTDM_OUT60_IC_1_VALUE                 0x0

/* FTDM_OUT61  - Registers (IC 1) */
#define REG_FTDM_OUT61_IC_1_ADDR                  0xF3BD
#define REG_FTDM_OUT61_IC_1_BYTE                  2
#define REG_FTDM_OUT61_IC_1_VALUE                 0x0

/* FTDM_OUT62  - Registers (IC 1) */
#define REG_FTDM_OUT62_IC_1_ADDR                  0xF3BE
#define REG_FTDM_OUT62_IC_1_BYTE                  2
#define REG_FTDM_OUT62_IC_1_VALUE                 0x0

/* FTDM_OUT63  - Registers (IC 1) */
#define REG_FTDM_OUT63_IC_1_ADDR                  0xF3BF
#define REG_FTDM_OUT63_IC_1_BYTE                  2
#define REG_FTDM_OUT63_IC_1_VALUE                 0x0

/* HIBERNATE  - Registers (IC 1) */
#define REG_HIBERNATE_IC_1_ADDR                   0xF400
#define REG_HIBERNATE_IC_1_BYTE                   2
#define REG_HIBERNATE_IC_1_VALUE                  0x1

/* START_PULSE  - Registers (IC 1) */
#define REG_START_PULSE_IC_1_ADDR                 0xF401
#define REG_START_PULSE_IC_1_BYTE                 2
#define REG_START_PULSE_IC_1_VALUE                0x2

/* START_CORE  - Registers (IC 1) */
#define REG_START_CORE_IC_1_ADDR                  0xF402
#define REG_START_CORE_IC_1_BYTE                  2
#define REG_START_CORE_IC_1_VALUE                 0x1

/* KILL_CORE  - Registers (IC 1) */
#define REG_KILL_CORE_IC_1_ADDR                   0xF403
#define REG_KILL_CORE_IC_1_BYTE                   2
#define REG_KILL_CORE_IC_1_VALUE                  0x1

/* START_ADDRESS  - Registers (IC 1) */
#define REG_START_ADDRESS_IC_1_ADDR               0xF404
#define REG_START_ADDRESS_IC_1_BYTE               2
#define REG_START_ADDRESS_IC_1_VALUE              0x0

/* CORE_STATUS  - Registers (IC 1) */
#define REG_CORE_STATUS_IC_1_ADDR                 0xF405
#define REG_CORE_STATUS_IC_1_BYTE                 0
#define REG_CORE_STATUS_IC_1_VALUE                0x0

/* PANIC_CLEAR  - Registers (IC 1) */
#define REG_PANIC_CLEAR_IC_1_ADDR                 0xF421
#define REG_PANIC_CLEAR_IC_1_BYTE                 2
#define REG_PANIC_CLEAR_IC_1_VALUE                0x0

/* PANIC_PARITY_MASK  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK_IC_1_ADDR           0xF422
#define REG_PANIC_PARITY_MASK_IC_1_BYTE           2
#define REG_PANIC_PARITY_MASK_IC_1_VALUE          0x3

/* PANIC_SOFTWARE_MASK  - Registers (IC 1) */
#define REG_PANIC_SOFTWARE_MASK_IC_1_ADDR         0xF423
#define REG_PANIC_SOFTWARE_MASK_IC_1_BYTE         2
#define REG_PANIC_SOFTWARE_MASK_IC_1_VALUE        0x0

/* PANIC_WD_MASK  - Registers (IC 1) */
#define REG_PANIC_WD_MASK_IC_1_ADDR               0xF424
#define REG_PANIC_WD_MASK_IC_1_BYTE               2
#define REG_PANIC_WD_MASK_IC_1_VALUE              0x0

/* PANIC_STACK_MASK  - Registers (IC 1) */
#define REG_PANIC_STACK_MASK_IC_1_ADDR            0xF425
#define REG_PANIC_STACK_MASK_IC_1_BYTE            2
#define REG_PANIC_STACK_MASK_IC_1_VALUE           0x0

/* PANIC_LOOP_MASK  - Registers (IC 1) */
#define REG_PANIC_LOOP_MASK_IC_1_ADDR             0xF426
#define REG_PANIC_LOOP_MASK_IC_1_BYTE             2
#define REG_PANIC_LOOP_MASK_IC_1_VALUE            0x0

/* PANIC_FLAG  - Registers (IC 1) */
#define REG_PANIC_FLAG_IC_1_ADDR                  0xF427
#define REG_PANIC_FLAG_IC_1_BYTE                  0
#define REG_PANIC_FLAG_IC_1_VALUE                 0x0

/* PANIC_CODE  - Registers (IC 1) */
#define REG_PANIC_CODE_IC_1_ADDR                  0xF428
#define REG_PANIC_CODE_IC_1_BYTE                  0
#define REG_PANIC_CODE_IC_1_VALUE                 0x0

/* EXECUTE_COUNT  - Registers (IC 1) */
#define REG_EXECUTE_COUNT_IC_1_ADDR               0xF432
#define REG_EXECUTE_COUNT_IC_1_BYTE               0
#define REG_EXECUTE_COUNT_IC_1_VALUE              0x0

/* WATCHDOG_MAXCOUNT  - Registers (IC 1) */
#define REG_WATCHDOG_MAXCOUNT_IC_1_ADDR           0xF443
#define REG_WATCHDOG_MAXCOUNT_IC_1_BYTE           2
#define REG_WATCHDOG_MAXCOUNT_IC_1_VALUE          0x0

/* WATCHDOG_PRESCALE  - Registers (IC 1) */
#define REG_WATCHDOG_PRESCALE_IC_1_ADDR           0xF444
#define REG_WATCHDOG_PRESCALE_IC_1_BYTE           2
#define REG_WATCHDOG_PRESCALE_IC_1_VALUE          0x0

/* BLOCKINT_EN  - Registers (IC 1) */
#define REG_BLOCKINT_EN_IC_1_ADDR                 0xF450
#define REG_BLOCKINT_EN_IC_1_BYTE                 2
#define REG_BLOCKINT_EN_IC_1_VALUE                0x0

/* BLOCKINT_VALUE  - Registers (IC 1) */
#define REG_BLOCKINT_VALUE_IC_1_ADDR              0xF451
#define REG_BLOCKINT_VALUE_IC_1_BYTE              2
#define REG_BLOCKINT_VALUE_IC_1_VALUE             0x0

/* PROG_CNTR0  - Registers (IC 1) */
#define REG_PROG_CNTR0_IC_1_ADDR                  0xF460
#define REG_PROG_CNTR0_IC_1_BYTE                  0
#define REG_PROG_CNTR0_IC_1_VALUE                 0x0

/* PROG_CNTR1  - Registers (IC 1) */
#define REG_PROG_CNTR1_IC_1_ADDR                  0xF461
#define REG_PROG_CNTR1_IC_1_BYTE                  0
#define REG_PROG_CNTR1_IC_1_VALUE                 0x0

/* PROG_CNTR_CLEAR  - Registers (IC 1) */
#define REG_PROG_CNTR_CLEAR_IC_1_ADDR             0xF462
#define REG_PROG_CNTR_CLEAR_IC_1_BYTE             2
#define REG_PROG_CNTR_CLEAR_IC_1_VALUE            0x0

/* PROG_CNTR_LENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH0_IC_1_ADDR           0xF463
#define REG_PROG_CNTR_LENGTH0_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH0_IC_1_VALUE          0x0

/* PROG_CNTR_LENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_LENGTH1_IC_1_ADDR           0xF464
#define REG_PROG_CNTR_LENGTH1_IC_1_BYTE           0
#define REG_PROG_CNTR_LENGTH1_IC_1_VALUE          0x0

/* PROG_CNTR_MAXLENGTH0  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_ADDR        0xF465
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH0_IC_1_VALUE       0x0

/* PROG_CNTR_MAXLENGTH1  - Registers (IC 1) */
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_ADDR        0xF466
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_BYTE        0
#define REG_PROG_CNTR_MAXLENGTH1_IC_1_VALUE       0x0

/* PANIC_PARITY_MASK1  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK1_IC_1_ADDR          0xF467
#define REG_PANIC_PARITY_MASK1_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK1_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK2  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK2_IC_1_ADDR          0xF468
#define REG_PANIC_PARITY_MASK2_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK2_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK3  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK3_IC_1_ADDR          0xF469
#define REG_PANIC_PARITY_MASK3_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK3_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK4  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK4_IC_1_ADDR          0xF46A
#define REG_PANIC_PARITY_MASK4_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK4_IC_1_VALUE         0x0

/* PANIC_PARITY_MASK5  - Registers (IC 1) */
#define REG_PANIC_PARITY_MASK5_IC_1_ADDR          0xF46B
#define REG_PANIC_PARITY_MASK5_IC_1_BYTE          2
#define REG_PANIC_PARITY_MASK5_IC_1_VALUE         0x0

