LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* ASRC3_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC3_RAMPMAX_IC_1_ADDR               0xF594
#define REG_ASRC3_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC3_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC4_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC4_RAMPMAX_IC_1_ADDR               0xF595
#define REG_ASRC4_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC4_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC5_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC5_RAMPMAX_IC_1_ADDR               0xF596
#define REG_ASRC5_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC5_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC6_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC6_RAMPMAX_IC_1_ADDR               0xF597
#define REG_ASRC6_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC6_RAMPMAX_IC_1_VALUE              0x7FF

/* ASRC7_RAMPMAX  - Registers (IC 1) */
#define REG_ASRC7_RAMPMAX_IC_1_ADDR               0xF598
#define REG_ASRC7_RAMPMAX_IC_1_BYTE               2
#define REG_ASRC7_RAMPMAX_IC_1_VALUE              0x7FF

/* ADC_READ0  - Registers (IC 1) */
#define REG_ADC_READ0_IC_1_ADDR                   0xF5A0
#define REG_ADC_READ0_IC_1_BYTE                   0
#define REG_ADC_READ0_IC_1_VALUE                  0x0

/* ADC_READ1  - Registers (IC 1) */
#define REG_ADC_READ1_IC_1_ADDR                   0xF5A1
#define REG_ADC_READ1_IC_1_BYTE                   0
#define REG_ADC_READ1_IC_1_VALUE                  0x0

/* ADC_READ2  - Registers (IC 1) */
#define REG_ADC_READ2_IC_1_ADDR                   0xF5A2
#define REG_ADC_READ2_IC_1_BYTE                   0
#define REG_ADC_READ2_IC_1_VALUE                  0x0

/* ADC_READ3  - Registers (IC 1) */
#define REG_ADC_READ3_IC_1_ADDR                   0xF5A3
#define REG_ADC_READ3_IC_1_BYTE                   0
#define REG_ADC_READ3_IC_1_VALUE                  0x0

/* ADC_READ4  - Registers (IC 1) */
#define REG_ADC_READ4_IC_1_ADDR                   0xF5A4
#define REG_ADC_READ4_IC_1_BYTE                   0
#define REG_ADC_READ4_IC_1_VALUE                  0x0

/* ADC_READ5  - Registers (IC 1) */
#define REG_ADC_READ5_IC_1_ADDR                   0xF5A5
#define REG_ADC_READ5_IC_1_BYTE                   0
#define REG_ADC_READ5_IC_1_VALUE                  0x0

/* ADC_READ6  - Registers (IC 1) */
#define REG_ADC_READ6_IC_1_ADDR                   0xF5A6
#define REG_ADC_READ6_IC_1_BYTE                   0
#define REG_ADC_READ6_IC_1_VALUE                  0x0

/* ADC_READ7  - Registers (IC 1) */
#define REG_ADC_READ7_IC_1_ADDR                   0xF5A7
#define REG_ADC_READ7_IC_1_BYTE                   0
#define REG_ADC_READ7_IC_1_VALUE                  0x0

/* MP0_MODE1  - Registers (IC 1) */
#define REG_MP0_MODE1_IC_1_ADDR                   0xF5C0
#define REG_MP0_MODE1_IC_1_BYTE                   2
#define REG_MP0_MODE1_IC_1_VALUE                  0x0

/* MP1_MODE1  - Registers (IC 1) */
#define REG_MP1_MODE1_IC_1_ADDR                   0xF5C1
#define REG_MP1_MODE1_IC_1_BYTE                   2
#define REG_MP1_MODE1_IC_1_VALUE                  0x0

/* MP2_MODE1  - Registers (IC 1) */
#define REG_MP2_MODE1_IC_1_ADDR                   0xF5C2
#define REG_MP2_MODE1_IC_1_BYTE                   2
#define REG_MP2_MODE1_IC_1_VALUE                  0x0

/* MP3_MODE1  - Registers (IC 1) */
#define REG_MP3_MODE1_IC_1_ADDR                   0xF5C3
#define REG_MP3_MODE1_IC_1_BYTE                   2
#define REG_MP3_MODE1_IC_1_VALUE                  0x0

/* MP4_MODE1  - Registers (IC 1) */
#define REG_MP4_MODE1_IC_1_ADDR                   0xF5C4
#define REG_MP4_MODE1_IC_1_BYTE                   2
#define REG_MP4_MODE1_IC_1_VALUE                  0x0

/* MP5_MODE1  - Registers (IC 1) */
#define REG_MP5_MODE1_IC_1_ADDR                   0xF5C5
#define REG_MP5_MODE1_IC_1_BYTE                   2
#define REG_MP5_MODE1_IC_1_VALUE                  0x0

/* MP6_MODE1  - Registers (IC 1) */
#define REG_MP6_MODE1_IC_1_ADDR                   0xF5C6
#define REG_MP6_MODE1_IC_1_BYTE                   2
#define REG_MP6_MODE1_IC_1_VALUE                  0x0

/* MP7_MODE1  - Registers (IC 1) */
#define REG_MP7_MODE1_IC_1_ADDR                   0xF5C7
#define REG_MP7_MODE1_IC_1_BYTE                   2
#define REG_MP7_MODE1_IC_1_VALUE                  0x0

/* MP8_MODE1  - Registers (IC 1) */
#define REG_MP8_MODE1_IC_1_ADDR                   0xF5C8
#define REG_MP8_MODE1_IC_1_BYTE                   2
#define REG_MP8_MODE1_IC_1_VALUE                  0x0

/* MP9_MODE1  - Registers (IC 1) */
#define REG_MP9_MODE1_IC_1_ADDR                   0xF5C9
#define REG_MP9_MODE1_IC_1_BYTE                   2
#define REG_MP9_MODE1_IC_1_VALUE                  0x4

/* MP10_MODE1  - Registers (IC 1) */
#define REG_MP10_MODE1_IC_1_ADDR                  0xF5CA
#define REG_MP10_MODE1_IC_1_BYTE                  2
#define REG_MP10_MODE1_IC_1_VALUE                 0x0

/* MP11_MODE1  - Registers (IC 1) */
#define REG_MP11_MODE1_IC_1_ADDR                  0xF5CB
#define REG_MP11_MODE1_IC_1_BYTE                  2
#define REG_MP11_MODE1_IC_1_VALUE                 0x0

/* MP0_WRITE1  - Registers (IC 1) */
#define REG_MP0_WRITE1_IC_1_ADDR                  0xF5D0
#define REG_MP0_WRITE1_IC_1_BYTE                  2
#define REG_MP0_WRITE1_IC_1_VALUE                 0x0

/* MP1_WRITE1  - Registers (IC 1) */
#define REG_MP1_WRITE1_IC_1_ADDR                  0xF5D1
#define REG_MP1_WRITE1_IC_1_BYTE                  2
#define REG_MP1_WRITE1_IC_1_VALUE                 0x0

/* MP2_WRITE1  - Registers (IC 1) */
#define REG_MP2_WRITE1_IC_1_ADDR                  0xF5D2
#define REG_MP2_WRITE1_IC_1_BYTE                  2
#define REG_MP2_WRITE1_IC_1_VALUE                 0x0

/* MP3_WRITE1  - Registers (IC 1) */
#define REG_MP3_WRITE1_IC_1_ADDR                  0xF5D3
#define REG_MP3_WRITE1_IC_1_BYTE                  2
#define REG_MP3_WRITE1_IC_1_VALUE                 0x0

/* MP4_WRITE1  - Registers (IC 1) */
#define REG_MP4_WRITE1_IC_1_ADDR                  0xF5D4
#define REG_MP4_WRITE1_IC_1_BYTE                  2
#define REG_MP4_WRITE1_IC_1_VALUE                 0x0

/* MP5_WRITE1  - Registers (IC 1) */
#define REG_MP5_WRITE1_IC_1_ADDR                  0xF5D5
#define REG_MP5_WRITE1_IC_1_BYTE                  2
#define REG_MP5_WRITE1_IC_1_VALUE                 0x0

/* MP6_WRITE1  - Registers (IC 1) */
#define REG_MP6_WRITE1_IC_1_ADDR                  0xF5D6
#define REG_MP6_WRITE1_IC_1_BYTE                  2
#define REG_MP6_WRITE1_IC_1_VALUE                 0x0

