LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* MP7_WRITE1  - Registers (IC 1) */
#define REG_MP7_WRITE1_IC_1_ADDR                  0xF5D7
#define REG_MP7_WRITE1_IC_1_BYTE                  2
#define REG_MP7_WRITE1_IC_1_VALUE                 0x0

/* MP8_WRITE1  - Registers (IC 1) */
#define REG_MP8_WRITE1_IC_1_ADDR                  0xF5D8
#define REG_MP8_WRITE1_IC_1_BYTE                  2
#define REG_MP8_WRITE1_IC_1_VALUE                 0x0

/* MP9_WRITE1  - Registers (IC 1) */
#define REG_MP9_WRITE1_IC_1_ADDR                  0xF5D9
#define REG_MP9_WRITE1_IC_1_BYTE                  2
#define REG_MP9_WRITE1_IC_1_VALUE                 0x0

/* MP10_WRITE1  - Registers (IC 1) */
#define REG_MP10_WRITE1_IC_1_ADDR                 0xF5DA
#define REG_MP10_WRITE1_IC_1_BYTE                 2
#define REG_MP10_WRITE1_IC_1_VALUE                0x0

/* MP11_WRITE1  - Registers (IC 1) */
#define REG_MP11_WRITE1_IC_1_ADDR                 0xF5DB
#define REG_MP11_WRITE1_IC_1_BYTE                 2
#define REG_MP11_WRITE1_IC_1_VALUE                0x0

/* MP0_READ1  - Registers (IC 1) */
#define REG_MP0_READ1_IC_1_ADDR                   0xF5E0
#define REG_MP0_READ1_IC_1_BYTE                   0
#define REG_MP0_READ1_IC_1_VALUE                  0x0

/* MP1_READ1  - Registers (IC 1) */
#define REG_MP1_READ1_IC_1_ADDR                   0xF5E1
#define REG_MP1_READ1_IC_1_BYTE                   0
#define REG_MP1_READ1_IC_1_VALUE                  0x0

/* MP2_READ1  - Registers (IC 1) */
#define REG_MP2_READ1_IC_1_ADDR                   0xF5E2
#define REG_MP2_READ1_IC_1_BYTE                   0
#define REG_MP2_READ1_IC_1_VALUE                  0x0

/* MP3_READ1  - Registers (IC 1) */
#define REG_MP3_READ1_IC_1_ADDR                   0xF5E3
#define REG_MP3_READ1_IC_1_BYTE                   0
#define REG_MP3_READ1_IC_1_VALUE                  0x0

/* MP4_READ1  - Registers (IC 1) */
#define REG_MP4_READ1_IC_1_ADDR                   0xF5E4
#define REG_MP4_READ1_IC_1_BYTE                   0
#define REG_MP4_READ1_IC_1_VALUE                  0x0

/* MP5_READ1  - Registers (IC 1) */
#define REG_MP5_READ1_IC_1_ADDR                   0xF5E5
#define REG_MP5_READ1_IC_1_BYTE                   0
#define REG_MP5_READ1_IC_1_VALUE                  0x0

/* MP6_READ1  - Registers (IC 1) */
#define REG_MP6_READ1_IC_1_ADDR                   0xF5E6
#define REG_MP6_READ1_IC_1_BYTE                   0
#define REG_MP6_READ1_IC_1_VALUE                  0x0

/* MP7_READ1  - Registers (IC 1) */
#define REG_MP7_READ1_IC_1_ADDR                   0xF5E7
#define REG_MP7_READ1_IC_1_BYTE                   0
#define REG_MP7_READ1_IC_1_VALUE                  0x0

/* MP8_READ1  - Registers (IC 1) */
#define REG_MP8_READ1_IC_1_ADDR                   0xF5E8
#define REG_MP8_READ1_IC_1_BYTE                   0
#define REG_MP8_READ1_IC_1_VALUE                  0x0

/* MP9_READ1  - Registers (IC 1) */
#define REG_MP9_READ1_IC_1_ADDR                   0xF5E9
#define REG_MP9_READ1_IC_1_BYTE                   0
#define REG_MP9_READ1_IC_1_VALUE                  0x0

/* MP10_READ1  - Registers (IC 1) */
#define REG_MP10_READ1_IC_1_ADDR                  0xF5EA
#define REG_MP10_READ1_IC_1_BYTE                  0
#define REG_MP10_READ1_IC_1_VALUE                 0x0

/* MP11_READ1  - Registers (IC 1) */
#define REG_MP11_READ1_IC_1_ADDR                  0xF5EB
#define REG_MP11_READ1_IC_1_BYTE                  0
#define REG_MP11_READ1_IC_1_VALUE                 0x0

/* SECONDARY_I2C  - Registers (IC 1) */
#define REG_SECONDARY_I2C_IC_1_ADDR               0xF5F0
#define REG_SECONDARY_I2C_IC_1_BYTE               2
#define REG_SECONDARY_I2C_IC_1_VALUE              0x1

/* SPDIF_LOCK_DET  - Registers (IC 1) */
#define REG_SPDIF_LOCK_DET_IC_1_ADDR              0xF600
#define REG_SPDIF_LOCK_DET_IC_1_BYTE              0
#define REG_SPDIF_LOCK_DET_IC_1_VALUE             0x0

/* SPDIF_RX_CTRL  - Registers (IC 1) */
#define REG_SPDIF_RX_CTRL_IC_1_ADDR               0xF601
#define REG_SPDIF_RX_CTRL_IC_1_BYTE               2
#define REG_SPDIF_RX_CTRL_IC_1_VALUE              0x0

/* SPDIF_RX_DECODE  - Registers (IC 1) */
#define REG_SPDIF_RX_DECODE_IC_1_ADDR             0xF602
#define REG_SPDIF_RX_DECODE_IC_1_BYTE             0
#define REG_SPDIF_RX_DECODE_IC_1_VALUE            0x88

/* SPDIF_RX_COMPRMODE  - Registers (IC 1) */
#define REG_SPDIF_RX_COMPRMODE_IC_1_ADDR          0xF603
#define REG_SPDIF_RX_COMPRMODE_IC_1_BYTE          0
#define REG_SPDIF_RX_COMPRMODE_IC_1_VALUE         0x0

/* SPDIF_RESTART  - Registers (IC 1) */
#define REG_SPDIF_RESTART_IC_1_ADDR               0xF604
#define REG_SPDIF_RESTART_IC_1_BYTE               2
#define REG_SPDIF_RESTART_IC_1_VALUE              0x1

/* SPDIF_LOSS_OF_LOCK  - Registers (IC 1) */
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_ADDR          0xF605
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_BYTE          0
#define REG_SPDIF_LOSS_OF_LOCK_IC_1_VALUE         0x0

/* SPDIF_RX_MCLKSPEED  - Registers (IC 1) */
#define REG_SPDIF_RX_MCLKSPEED_IC_1_ADDR          0xF606
#define REG_SPDIF_RX_MCLKSPEED_IC_1_BYTE          2
#define REG_SPDIF_RX_MCLKSPEED_IC_1_VALUE         0x1

/* SPDIF_TX_MCLKSPEED  - Registers (IC 1) */
#define REG_SPDIF_TX_MCLKSPEED_IC_1_ADDR          0xF607
#define REG_SPDIF_TX_MCLKSPEED_IC_1_BYTE          2
#define REG_SPDIF_TX_MCLKSPEED_IC_1_VALUE         0x1

/* SPDIF_AUX_EN  - Registers (IC 1) */
#define REG_SPDIF_AUX_EN_IC_1_ADDR                0xF608
#define REG_SPDIF_AUX_EN_IC_1_BYTE                2
#define REG_SPDIF_AUX_EN_IC_1_VALUE               0x0

/* SPDIF_RX_AUXBIT_READY  - Registers (IC 1) */
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_ADDR       0xF60F
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_BYTE       0
#define REG_SPDIF_RX_AUXBIT_READY_IC_1_VALUE      0x0

/* SPDIF_RX_CS_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_ADDR          0xF610
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_ADDR          0xF611
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_ADDR          0xF612
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_ADDR          0xF613
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_ADDR          0xF614
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_ADDR          0xF615
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_ADDR          0xF616
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_ADDR          0xF617
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_RX_CS_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_ADDR          0xF618
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_BYTE          0
#define REG_SPDIF_RX_CS_LEFT_8_IC_1_VALUE         0x0

