LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* SPDIF_RX_VB_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_ADDR         0xF669
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_BYTE         0
#define REG_SPDIF_RX_VB_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_RX_VB_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_ADDR        0xF66A
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_BYTE        0
#define REG_SPDIF_RX_VB_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_RX_VB_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_ADDR        0xF66B
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_BYTE        0
#define REG_SPDIF_RX_VB_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_RX_PB_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_ADDR          0xF670
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_ADDR          0xF671
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_ADDR          0xF672
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_ADDR          0xF673
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_ADDR          0xF674
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_ADDR          0xF675
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_ADDR          0xF676
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_ADDR          0xF677
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_7_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_8_IC_1_ADDR          0xF678
#define REG_SPDIF_RX_PB_LEFT_8_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_8_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_9_IC_1_ADDR          0xF679
#define REG_SPDIF_RX_PB_LEFT_9_IC_1_BYTE          0
#define REG_SPDIF_RX_PB_LEFT_9_IC_1_VALUE         0x0

/* SPDIF_RX_PB_LEFT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_10_IC_1_ADDR         0xF67A
#define REG_SPDIF_RX_PB_LEFT_10_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_LEFT_10_IC_1_VALUE        0x0

/* SPDIF_RX_PB_LEFT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_LEFT_11_IC_1_ADDR         0xF67B
#define REG_SPDIF_RX_PB_LEFT_11_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_LEFT_11_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_0  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_0_IC_1_ADDR         0xF680
#define REG_SPDIF_RX_PB_RIGHT_0_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_0_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_1  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_1_IC_1_ADDR         0xF681
#define REG_SPDIF_RX_PB_RIGHT_1_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_1_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_2  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_2_IC_1_ADDR         0xF682
#define REG_SPDIF_RX_PB_RIGHT_2_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_2_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_3  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_3_IC_1_ADDR         0xF683
#define REG_SPDIF_RX_PB_RIGHT_3_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_3_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_4  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_4_IC_1_ADDR         0xF684
#define REG_SPDIF_RX_PB_RIGHT_4_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_4_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_5  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_5_IC_1_ADDR         0xF685
#define REG_SPDIF_RX_PB_RIGHT_5_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_5_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_6  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_6_IC_1_ADDR         0xF686
#define REG_SPDIF_RX_PB_RIGHT_6_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_6_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_7  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_7_IC_1_ADDR         0xF687
#define REG_SPDIF_RX_PB_RIGHT_7_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_7_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_8  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_8_IC_1_ADDR         0xF688
#define REG_SPDIF_RX_PB_RIGHT_8_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_8_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_9  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_9_IC_1_ADDR         0xF689
#define REG_SPDIF_RX_PB_RIGHT_9_IC_1_BYTE         0
#define REG_SPDIF_RX_PB_RIGHT_9_IC_1_VALUE        0x0

/* SPDIF_RX_PB_RIGHT_10  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_10_IC_1_ADDR        0xF68A
#define REG_SPDIF_RX_PB_RIGHT_10_IC_1_BYTE        0
#define REG_SPDIF_RX_PB_RIGHT_10_IC_1_VALUE       0x0

/* SPDIF_RX_PB_RIGHT_11  - Registers (IC 1) */
#define REG_SPDIF_RX_PB_RIGHT_11_IC_1_ADDR        0xF68B
#define REG_SPDIF_RX_PB_RIGHT_11_IC_1_BYTE        0
#define REG_SPDIF_RX_PB_RIGHT_11_IC_1_VALUE       0x0

/* SPDIF_TX_EN  - Registers (IC 1) */
#define REG_SPDIF_TX_EN_IC_1_ADDR                 0xF690
#define REG_SPDIF_TX_EN_IC_1_BYTE                 2
#define REG_SPDIF_TX_EN_IC_1_VALUE                0x0

/* SPDIF_TX_CTRL  - Registers (IC 1) */
#define REG_SPDIF_TX_CTRL_IC_1_ADDR               0xF691
#define REG_SPDIF_TX_CTRL_IC_1_BYTE               2
#define REG_SPDIF_TX_CTRL_IC_1_VALUE              0x0

/* SPDIF_TX_AUXBIT_SOURCE  - Registers (IC 1) */
#define REG_SPDIF_TX_AUXBIT_SOURCE_IC_1_ADDR      0xF69F
#define REG_SPDIF_TX_AUXBIT_SOURCE_IC_1_BYTE      2
#define REG_SPDIF_TX_AUXBIT_SOURCE_IC_1_VALUE     0x0

/* SPDIF_TX_CS_LEFT_0  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_0_IC_1_ADDR          0xF6A0
#define REG_SPDIF_TX_CS_LEFT_0_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_0_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_1  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_1_IC_1_ADDR          0xF6A1
#define REG_SPDIF_TX_CS_LEFT_1_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_1_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_2  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_2_IC_1_ADDR          0xF6A2
#define REG_SPDIF_TX_CS_LEFT_2_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_2_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_3  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_3_IC_1_ADDR          0xF6A3
#define REG_SPDIF_TX_CS_LEFT_3_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_3_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_4  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_4_IC_1_ADDR          0xF6A4
#define REG_SPDIF_TX_CS_LEFT_4_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_4_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_5  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_5_IC_1_ADDR          0xF6A5
#define REG_SPDIF_TX_CS_LEFT_5_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_5_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_6  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_6_IC_1_ADDR          0xF6A6
#define REG_SPDIF_TX_CS_LEFT_6_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_6_IC_1_VALUE         0x0

/* SPDIF_TX_CS_LEFT_7  - Registers (IC 1) */
#define REG_SPDIF_TX_CS_LEFT_7_IC_1_ADDR          0xF6A7
#define REG_SPDIF_TX_CS_LEFT_7_IC_1_BYTE          2
#define REG_SPDIF_TX_CS_LEFT_7_IC_1_VALUE         0x0

