LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* CLKOUT_PIN  - Registers (IC 1) */
#define REG_CLKOUT_PIN_IC_1_ADDR                  0xF7A3
#define REG_CLKOUT_PIN_IC_1_BYTE                  2
#define REG_CLKOUT_PIN_IC_1_VALUE                 0x8

/* MP14_PIN  - Registers (IC 1) */
#define REG_MP14_PIN_IC_1_ADDR                    0xF7A8
#define REG_MP14_PIN_IC_1_BYTE                    2
#define REG_MP14_PIN_IC_1_VALUE                   0x18

/* MP15_PIN  - Registers (IC 1) */
#define REG_MP15_PIN_IC_1_ADDR                    0xF7A9
#define REG_MP15_PIN_IC_1_BYTE                    2
#define REG_MP15_PIN_IC_1_VALUE                   0x18

/* SDATA_IO0_PIN  - Registers (IC 1) */
#define REG_SDATA_IO0_PIN_IC_1_ADDR               0xF7B0
#define REG_SDATA_IO0_PIN_IC_1_BYTE               2
#define REG_SDATA_IO0_PIN_IC_1_VALUE              0x18

/* SDATA_IO1_PIN  - Registers (IC 1) */
#define REG_SDATA_IO1_PIN_IC_1_ADDR               0xF7B1
#define REG_SDATA_IO1_PIN_IC_1_BYTE               2
#define REG_SDATA_IO1_PIN_IC_1_VALUE              0x18

/* SDATA_IO2_PIN  - Registers (IC 1) */
#define REG_SDATA_IO2_PIN_IC_1_ADDR               0xF7B2
#define REG_SDATA_IO2_PIN_IC_1_BYTE               2
#define REG_SDATA_IO2_PIN_IC_1_VALUE              0x18

/* SDATA_IO3_PIN  - Registers (IC 1) */
#define REG_SDATA_IO3_PIN_IC_1_ADDR               0xF7B3
#define REG_SDATA_IO3_PIN_IC_1_BYTE               2
#define REG_SDATA_IO3_PIN_IC_1_VALUE              0x18

/* SDATA_IO4_PIN  - Registers (IC 1) */
#define REG_SDATA_IO4_PIN_IC_1_ADDR               0xF7B4
#define REG_SDATA_IO4_PIN_IC_1_BYTE               2
#define REG_SDATA_IO4_PIN_IC_1_VALUE              0x18

/* SDATA_IO5_PIN  - Registers (IC 1) */
#define REG_SDATA_IO5_PIN_IC_1_ADDR               0xF7B5
#define REG_SDATA_IO5_PIN_IC_1_BYTE               2
#define REG_SDATA_IO5_PIN_IC_1_VALUE              0x18

/* SDATA_IO6_PIN  - Registers (IC 1) */
#define REG_SDATA_IO6_PIN_IC_1_ADDR               0xF7B6
#define REG_SDATA_IO6_PIN_IC_1_BYTE               2
#define REG_SDATA_IO6_PIN_IC_1_VALUE              0x18

/* SDATA_IO7_PIN  - Registers (IC 1) */
#define REG_SDATA_IO7_PIN_IC_1_ADDR               0xF7B7
#define REG_SDATA_IO7_PIN_IC_1_BYTE               2
#define REG_SDATA_IO7_PIN_IC_1_VALUE              0x18

/* MP24_PIN  - Registers (IC 1) */
#define REG_MP24_PIN_IC_1_ADDR                    0xF7B8
#define REG_MP24_PIN_IC_1_BYTE                    2
#define REG_MP24_PIN_IC_1_VALUE                   0x8

/* MP25_PIN  - Registers (IC 1) */
#define REG_MP25_PIN_IC_1_ADDR                    0xF7B9
#define REG_MP25_PIN_IC_1_BYTE                    2
#define REG_MP25_PIN_IC_1_VALUE                   0x8

/* SOFT_RESET  - Registers (IC 1) */
#define REG_SOFT_RESET_IC_1_ADDR                  0xF890
#define REG_SOFT_RESET_IC_1_BYTE                  2
#define REG_SOFT_RESET_IC_1_VALUE                 0x1

/* SECOND_PAGE_ENABLE  - Registers (IC 1) */
#define REG_SECOND_PAGE_ENABLE_IC_1_ADDR          0xF899
#define REG_SECOND_PAGE_ENABLE_IC_1_BYTE          2
#define REG_SECOND_PAGE_ENABLE_IC_1_VALUE         0x0


/*
 *
 * Control register's field descriptions
 *
 */

/* PLL_CTRL0 (IC 1) */
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1           0x60   /* 1100000b	[6:0] */
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1_MASK      0x7F
#define R0_PLL_CTRL0_PLL_FBDIVIDER_IC_1_SHIFT     0

/* PLL_CTRL1 (IC 1) */
#define R1_PLL_CTRL1_PLL_DIV_IC_1                 0x3    /* 11b	[1:0] */
#define R1_PLL_CTRL1_PLL_DIV_IC_1_MASK            0x3
#define R1_PLL_CTRL1_PLL_DIV_IC_1_SHIFT           0

/* PLL_CLK_SRC (IC 1) */
#define R2_PLL_CLK_SRC_CLKSRC_IC_1                0x1    /* 1b	[0] */
#define R2_PLL_CLK_SRC_CLKSRC_IC_1_MASK           0x1
#define R2_PLL_CLK_SRC_CLKSRC_IC_1_SHIFT          0

/* PLL_ENABLE (IC 1) */
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1             0x1    /* 1b	[0] */
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1_MASK        0x1
#define R3_PLL_ENABLE_PLL_ENABLE_IC_1_SHIFT       0

/* PLL_LOCK (IC 1) */
#define R4_PLL_LOCK_PLL_LOCK_IC_1                 0x0    /* 0b	[0] */
#define R4_PLL_LOCK_PLL_LOCK_IC_1_MASK            0x1
#define R4_PLL_LOCK_PLL_LOCK_IC_1_SHIFT           0

/* MCLK_OUT (IC 1) */
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1            0x1    /* 1b	[0] */
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1              0x2    /* 10b	[2:1] */
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1_MASK       0x1
#define R5_MCLK_OUT_CLKOUT_ENABLE_IC_1_SHIFT      0
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1_MASK         0x6
#define R5_MCLK_OUT_CLKOUT_RATE_IC_1_SHIFT        1

/* PLL_WATCHDOG (IC 1) */
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1         0x1    /* 1b	[0] */
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1_MASK    0x1
#define R6_PLL_WATCHDOG_PLL_WATCHDOG_IC_1_SHIFT   0

/* CLK_GEN1_M (IC 1) */
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1            0x03   /* 000000011b	[8:0] */
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1_MASK       0x1FF
#define R7_CLK_GEN1_M_CLOCKGEN1_M_IC_1_SHIFT      0

/* CLK_GEN1_N (IC 1) */
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1            0x02   /* 000000010b	[8:0] */
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1_MASK       0x1FF
#define R8_CLK_GEN1_N_CLOCKGEN1_N_IC_1_SHIFT      0

/* CLK_GEN2_M (IC 1) */
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1            0x09   /* 000001001b	[8:0] */
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1_MASK       0x1FF
#define R9_CLK_GEN2_M_CLOCKGEN2_M_IC_1_SHIFT      0

/* CLK_GEN2_N (IC 1) */
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1           0x01   /* 000000001b	[8:0] */
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1_MASK      0x1FF
#define R10_CLK_GEN2_N_CLOCKGEN2_N_IC_1_SHIFT     0

/* CLK_GEN3_M (IC 1) */
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1_MASK      0xFFFF
#define R11_CLK_GEN3_M_CLOCKGEN3_M_IC_1_SHIFT     0

/* CLK_GEN3_N (IC 1) */
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1           0x0000 /* 0000000000000000b	[15:0] */
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1_MASK      0xFFFF
#define R12_CLK_GEN3_N_CLOCKGEN3_N_IC_1_SHIFT     0

/* CLK_GEN3_SRC (IC 1) */
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1            0xE    /* 1110b	[3:0] */
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1        0x0    /* 0b	[4] */
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1_MASK       0xF
#define R13_CLK_GEN3_SRC_FREF_PIN_IC_1_SHIFT      0
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1_MASK   0x10
#define R13_CLK_GEN3_SRC_CLK_GEN3_SRC_IC_1_SHIFT  4

