LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* ASRC_OUT_RATE0 (IC 1) */
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1_MASK    0xF
#define R25_ASRC_OUT_RATE0_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE1 (IC 1) */
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1_MASK    0xF
#define R26_ASRC_OUT_RATE1_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE2 (IC 1) */
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1_MASK    0xF
#define R27_ASRC_OUT_RATE2_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE3 (IC 1) */
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1_MASK    0xF
#define R28_ASRC_OUT_RATE3_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE4 (IC 1) */
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1_MASK    0xF
#define R29_ASRC_OUT_RATE4_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE5 (IC 1) */
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1_MASK    0xF
#define R30_ASRC_OUT_RATE5_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE6 (IC 1) */
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1_MASK    0xF
#define R31_ASRC_OUT_RATE6_ASRC_RATE_IC_1_SHIFT   0

/* ASRC_OUT_RATE7 (IC 1) */
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1         0x0    /* 0000b	[3:0] */
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1_MASK    0xF
#define R32_ASRC_OUT_RATE7_ASRC_RATE_IC_1_SHIFT   0

/* SOUT_SOURCE0 (IC 1) */
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1_MASK    0x7
#define R33_SOUT_SOURCE0_SOUT_SOURCE_IC_1_SHIFT   0
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R33_SOUT_SOURCE0_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE1 (IC 1) */
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1_MASK    0x7
#define R34_SOUT_SOURCE1_SOUT_SOURCE_IC_1_SHIFT   0
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R34_SOUT_SOURCE1_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE2 (IC 1) */
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1_MASK    0x7
#define R35_SOUT_SOURCE2_SOUT_SOURCE_IC_1_SHIFT   0
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R35_SOUT_SOURCE2_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE3 (IC 1) */
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1_MASK    0x7
#define R36_SOUT_SOURCE3_SOUT_SOURCE_IC_1_SHIFT   0
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R36_SOUT_SOURCE3_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE4 (IC 1) */
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1_MASK    0x7
#define R37_SOUT_SOURCE4_SOUT_SOURCE_IC_1_SHIFT   0
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R37_SOUT_SOURCE4_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE5 (IC 1) */
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1_MASK    0x7
#define R38_SOUT_SOURCE5_SOUT_SOURCE_IC_1_SHIFT   0
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R38_SOUT_SOURCE5_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE6 (IC 1) */
#define R39_SOUT_SOURCE6_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R39_SOUT_SOURCE6_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R39_SOUT_SOURCE6_SOUT_SOURCE_IC_1_MASK    0x7
#define R39_SOUT_SOURCE6_SOUT_SOURCE_IC_1_SHIFT   0
#define R39_SOUT_SOURCE6_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R39_SOUT_SOURCE6_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE7 (IC 1) */
#define R40_SOUT_SOURCE7_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R40_SOUT_SOURCE7_SOUT_ASRC_SELECT_IC_1    0x0    /* 000b	[5:3] */
#define R40_SOUT_SOURCE7_SOUT_SOURCE_IC_1_MASK    0x7
#define R40_SOUT_SOURCE7_SOUT_SOURCE_IC_1_SHIFT   0
#define R40_SOUT_SOURCE7_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R40_SOUT_SOURCE7_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE8 (IC 1) */
#define R41_SOUT_SOURCE8_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R41_SOUT_SOURCE8_SOUT_ASRC_SELECT_IC_1    0x1    /* 001b	[5:3] */
#define R41_SOUT_SOURCE8_SOUT_SOURCE_IC_1_MASK    0x7
#define R41_SOUT_SOURCE8_SOUT_SOURCE_IC_1_SHIFT   0
#define R41_SOUT_SOURCE8_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R41_SOUT_SOURCE8_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE9 (IC 1) */
#define R42_SOUT_SOURCE9_SOUT_SOURCE_IC_1         0x2    /* 010b	[2:0] */
#define R42_SOUT_SOURCE9_SOUT_ASRC_SELECT_IC_1    0x1    /* 001b	[5:3] */
#define R42_SOUT_SOURCE9_SOUT_SOURCE_IC_1_MASK    0x7
#define R42_SOUT_SOURCE9_SOUT_SOURCE_IC_1_SHIFT   0
#define R42_SOUT_SOURCE9_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R42_SOUT_SOURCE9_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE10 (IC 1) */
#define R43_SOUT_SOURCE10_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R43_SOUT_SOURCE10_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R43_SOUT_SOURCE10_SOUT_SOURCE_IC_1_MASK   0x7
#define R43_SOUT_SOURCE10_SOUT_SOURCE_IC_1_SHIFT  0
#define R43_SOUT_SOURCE10_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R43_SOUT_SOURCE10_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE11 (IC 1) */
#define R44_SOUT_SOURCE11_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R44_SOUT_SOURCE11_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R44_SOUT_SOURCE11_SOUT_SOURCE_IC_1_MASK   0x7
#define R44_SOUT_SOURCE11_SOUT_SOURCE_IC_1_SHIFT  0
#define R44_SOUT_SOURCE11_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R44_SOUT_SOURCE11_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE12 (IC 1) */
#define R45_SOUT_SOURCE12_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R45_SOUT_SOURCE12_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R45_SOUT_SOURCE12_SOUT_SOURCE_IC_1_MASK   0x7
#define R45_SOUT_SOURCE12_SOUT_SOURCE_IC_1_SHIFT  0
#define R45_SOUT_SOURCE12_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R45_SOUT_SOURCE12_SOUT_ASRC_SELECT_IC_1_SHIFT 3

/* SOUT_SOURCE13 (IC 1) */
#define R46_SOUT_SOURCE13_SOUT_SOURCE_IC_1        0x2    /* 010b	[2:0] */
#define R46_SOUT_SOURCE13_SOUT_ASRC_SELECT_IC_1   0x0    /* 000b	[5:3] */
#define R46_SOUT_SOURCE13_SOUT_SOURCE_IC_1_MASK   0x7
#define R46_SOUT_SOURCE13_SOUT_SOURCE_IC_1_SHIFT  0
#define R46_SOUT_SOURCE13_SOUT_ASRC_SELECT_IC_1_MASK 0x38
#define R46_SOUT_SOURCE13_SOUT_ASRC_SELECT_IC_1_SHIFT 3

