LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* FTDM_IN20 (IC 1) */
#define R102_FTDM_IN20_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R102_FTDM_IN20_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R102_FTDM_IN20_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R102_FTDM_IN20_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R102_FTDM_IN20_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R102_FTDM_IN20_BYTE_IN_POS_IC_1_MASK      0x3
#define R102_FTDM_IN20_BYTE_IN_POS_IC_1_SHIFT     0
#define R102_FTDM_IN20_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R102_FTDM_IN20_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R102_FTDM_IN20_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R102_FTDM_IN20_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R102_FTDM_IN20_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R102_FTDM_IN20_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R102_FTDM_IN20_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R102_FTDM_IN20_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN21 (IC 1) */
#define R103_FTDM_IN21_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R103_FTDM_IN21_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R103_FTDM_IN21_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R103_FTDM_IN21_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R103_FTDM_IN21_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R103_FTDM_IN21_BYTE_IN_POS_IC_1_MASK      0x3
#define R103_FTDM_IN21_BYTE_IN_POS_IC_1_SHIFT     0
#define R103_FTDM_IN21_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R103_FTDM_IN21_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R103_FTDM_IN21_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R103_FTDM_IN21_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R103_FTDM_IN21_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R103_FTDM_IN21_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R103_FTDM_IN21_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R103_FTDM_IN21_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN22 (IC 1) */
#define R104_FTDM_IN22_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R104_FTDM_IN22_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R104_FTDM_IN22_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R104_FTDM_IN22_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R104_FTDM_IN22_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R104_FTDM_IN22_BYTE_IN_POS_IC_1_MASK      0x3
#define R104_FTDM_IN22_BYTE_IN_POS_IC_1_SHIFT     0
#define R104_FTDM_IN22_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R104_FTDM_IN22_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R104_FTDM_IN22_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R104_FTDM_IN22_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R104_FTDM_IN22_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R104_FTDM_IN22_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R104_FTDM_IN22_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R104_FTDM_IN22_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN23 (IC 1) */
#define R105_FTDM_IN23_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R105_FTDM_IN23_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R105_FTDM_IN23_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R105_FTDM_IN23_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R105_FTDM_IN23_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R105_FTDM_IN23_BYTE_IN_POS_IC_1_MASK      0x3
#define R105_FTDM_IN23_BYTE_IN_POS_IC_1_SHIFT     0
#define R105_FTDM_IN23_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R105_FTDM_IN23_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R105_FTDM_IN23_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R105_FTDM_IN23_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R105_FTDM_IN23_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R105_FTDM_IN23_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R105_FTDM_IN23_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R105_FTDM_IN23_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN24 (IC 1) */
#define R106_FTDM_IN24_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R106_FTDM_IN24_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R106_FTDM_IN24_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R106_FTDM_IN24_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R106_FTDM_IN24_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R106_FTDM_IN24_BYTE_IN_POS_IC_1_MASK      0x3
#define R106_FTDM_IN24_BYTE_IN_POS_IC_1_SHIFT     0
#define R106_FTDM_IN24_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R106_FTDM_IN24_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R106_FTDM_IN24_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R106_FTDM_IN24_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R106_FTDM_IN24_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R106_FTDM_IN24_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R106_FTDM_IN24_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R106_FTDM_IN24_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN25 (IC 1) */
#define R107_FTDM_IN25_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R107_FTDM_IN25_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R107_FTDM_IN25_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R107_FTDM_IN25_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R107_FTDM_IN25_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R107_FTDM_IN25_BYTE_IN_POS_IC_1_MASK      0x3
#define R107_FTDM_IN25_BYTE_IN_POS_IC_1_SHIFT     0
#define R107_FTDM_IN25_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R107_FTDM_IN25_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R107_FTDM_IN25_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R107_FTDM_IN25_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R107_FTDM_IN25_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R107_FTDM_IN25_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R107_FTDM_IN25_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R107_FTDM_IN25_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN26 (IC 1) */
#define R108_FTDM_IN26_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R108_FTDM_IN26_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R108_FTDM_IN26_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R108_FTDM_IN26_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R108_FTDM_IN26_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R108_FTDM_IN26_BYTE_IN_POS_IC_1_MASK      0x3
#define R108_FTDM_IN26_BYTE_IN_POS_IC_1_SHIFT     0
#define R108_FTDM_IN26_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R108_FTDM_IN26_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R108_FTDM_IN26_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R108_FTDM_IN26_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R108_FTDM_IN26_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R108_FTDM_IN26_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R108_FTDM_IN26_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R108_FTDM_IN26_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN27 (IC 1) */
#define R109_FTDM_IN27_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R109_FTDM_IN27_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R109_FTDM_IN27_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R109_FTDM_IN27_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R109_FTDM_IN27_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R109_FTDM_IN27_BYTE_IN_POS_IC_1_MASK      0x3
#define R109_FTDM_IN27_BYTE_IN_POS_IC_1_SHIFT     0
#define R109_FTDM_IN27_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R109_FTDM_IN27_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R109_FTDM_IN27_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R109_FTDM_IN27_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R109_FTDM_IN27_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R109_FTDM_IN27_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R109_FTDM_IN27_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R109_FTDM_IN27_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN28 (IC 1) */
#define R110_FTDM_IN28_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R110_FTDM_IN28_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R110_FTDM_IN28_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R110_FTDM_IN28_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R110_FTDM_IN28_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R110_FTDM_IN28_BYTE_IN_POS_IC_1_MASK      0x3
#define R110_FTDM_IN28_BYTE_IN_POS_IC_1_SHIFT     0
#define R110_FTDM_IN28_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R110_FTDM_IN28_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R110_FTDM_IN28_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R110_FTDM_IN28_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R110_FTDM_IN28_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R110_FTDM_IN28_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R110_FTDM_IN28_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R110_FTDM_IN28_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN29 (IC 1) */
#define R111_FTDM_IN29_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R111_FTDM_IN29_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R111_FTDM_IN29_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R111_FTDM_IN29_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R111_FTDM_IN29_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R111_FTDM_IN29_BYTE_IN_POS_IC_1_MASK      0x3
#define R111_FTDM_IN29_BYTE_IN_POS_IC_1_SHIFT     0
#define R111_FTDM_IN29_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R111_FTDM_IN29_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R111_FTDM_IN29_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R111_FTDM_IN29_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R111_FTDM_IN29_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R111_FTDM_IN29_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R111_FTDM_IN29_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R111_FTDM_IN29_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN30 (IC 1) */
#define R112_FTDM_IN30_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R112_FTDM_IN30_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R112_FTDM_IN30_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R112_FTDM_IN30_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R112_FTDM_IN30_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R112_FTDM_IN30_BYTE_IN_POS_IC_1_MASK      0x3
#define R112_FTDM_IN30_BYTE_IN_POS_IC_1_SHIFT     0
#define R112_FTDM_IN30_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R112_FTDM_IN30_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R112_FTDM_IN30_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R112_FTDM_IN30_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R112_FTDM_IN30_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R112_FTDM_IN30_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R112_FTDM_IN30_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R112_FTDM_IN30_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN31 (IC 1) */
#define R113_FTDM_IN31_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R113_FTDM_IN31_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R113_FTDM_IN31_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R113_FTDM_IN31_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R113_FTDM_IN31_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R113_FTDM_IN31_BYTE_IN_POS_IC_1_MASK      0x3
#define R113_FTDM_IN31_BYTE_IN_POS_IC_1_SHIFT     0
#define R113_FTDM_IN31_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R113_FTDM_IN31_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R113_FTDM_IN31_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R113_FTDM_IN31_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R113_FTDM_IN31_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R113_FTDM_IN31_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R113_FTDM_IN31_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R113_FTDM_IN31_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN32 (IC 1) */
#define R114_FTDM_IN32_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R114_FTDM_IN32_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R114_FTDM_IN32_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R114_FTDM_IN32_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R114_FTDM_IN32_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R114_FTDM_IN32_BYTE_IN_POS_IC_1_MASK      0x3
#define R114_FTDM_IN32_BYTE_IN_POS_IC_1_SHIFT     0
#define R114_FTDM_IN32_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R114_FTDM_IN32_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R114_FTDM_IN32_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R114_FTDM_IN32_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R114_FTDM_IN32_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R114_FTDM_IN32_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R114_FTDM_IN32_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R114_FTDM_IN32_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN33 (IC 1) */
#define R115_FTDM_IN33_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R115_FTDM_IN33_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R115_FTDM_IN33_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R115_FTDM_IN33_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R115_FTDM_IN33_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R115_FTDM_IN33_BYTE_IN_POS_IC_1_MASK      0x3
#define R115_FTDM_IN33_BYTE_IN_POS_IC_1_SHIFT     0
#define R115_FTDM_IN33_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R115_FTDM_IN33_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R115_FTDM_IN33_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R115_FTDM_IN33_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R115_FTDM_IN33_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R115_FTDM_IN33_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R115_FTDM_IN33_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R115_FTDM_IN33_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN34 (IC 1) */
#define R116_FTDM_IN34_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R116_FTDM_IN34_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R116_FTDM_IN34_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R116_FTDM_IN34_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R116_FTDM_IN34_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R116_FTDM_IN34_BYTE_IN_POS_IC_1_MASK      0x3
#define R116_FTDM_IN34_BYTE_IN_POS_IC_1_SHIFT     0
#define R116_FTDM_IN34_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R116_FTDM_IN34_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R116_FTDM_IN34_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R116_FTDM_IN34_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R116_FTDM_IN34_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R116_FTDM_IN34_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R116_FTDM_IN34_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R116_FTDM_IN34_SLOT_ENABLE_IN_IC_1_SHIFT  7

/* FTDM_IN35 (IC 1) */
#define R117_FTDM_IN35_BYTE_IN_POS_IC_1           0x0    /* 00b	[1:0] */
#define R117_FTDM_IN35_CHANNEL_IN_POS_IC_1        0x0    /* 000b	[4:2] */
#define R117_FTDM_IN35_SERIAL_IN_SEL_IC_1         0x0    /* 0b	[5] */
#define R117_FTDM_IN35_REVERSE_IN_BYTE_IC_1       0x0    /* 0b	[6] */
#define R117_FTDM_IN35_SLOT_ENABLE_IN_IC_1        0x0    /* 0b	[7] */
#define R117_FTDM_IN35_BYTE_IN_POS_IC_1_MASK      0x3
#define R117_FTDM_IN35_BYTE_IN_POS_IC_1_SHIFT     0
#define R117_FTDM_IN35_CHANNEL_IN_POS_IC_1_MASK   0x1C
#define R117_FTDM_IN35_CHANNEL_IN_POS_IC_1_SHIFT  2
#define R117_FTDM_IN35_SERIAL_IN_SEL_IC_1_MASK    0x20
#define R117_FTDM_IN35_SERIAL_IN_SEL_IC_1_SHIFT   5
#define R117_FTDM_IN35_REVERSE_IN_BYTE_IC_1_MASK  0x40
#define R117_FTDM_IN35_REVERSE_IN_BYTE_IC_1_SHIFT 6
#define R117_FTDM_IN35_SLOT_ENABLE_IN_IC_1_MASK   0x80
#define R117_FTDM_IN35_SLOT_ENABLE_IN_IC_1_SHIFT  7

