LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* FTDM_OUT39 (IC 1) */
#define R185_FTDM_OUT39_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R185_FTDM_OUT39_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R185_FTDM_OUT39_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R185_FTDM_OUT39_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R185_FTDM_OUT39_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R185_FTDM_OUT39_BYTE_OUT_POS_IC_1_MASK    0x3
#define R185_FTDM_OUT39_BYTE_OUT_POS_IC_1_SHIFT   0
#define R185_FTDM_OUT39_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R185_FTDM_OUT39_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R185_FTDM_OUT39_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R185_FTDM_OUT39_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R185_FTDM_OUT39_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R185_FTDM_OUT39_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R185_FTDM_OUT39_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R185_FTDM_OUT39_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT40 (IC 1) */
#define R186_FTDM_OUT40_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R186_FTDM_OUT40_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R186_FTDM_OUT40_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R186_FTDM_OUT40_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R186_FTDM_OUT40_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R186_FTDM_OUT40_BYTE_OUT_POS_IC_1_MASK    0x3
#define R186_FTDM_OUT40_BYTE_OUT_POS_IC_1_SHIFT   0
#define R186_FTDM_OUT40_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R186_FTDM_OUT40_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R186_FTDM_OUT40_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R186_FTDM_OUT40_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R186_FTDM_OUT40_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R186_FTDM_OUT40_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R186_FTDM_OUT40_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R186_FTDM_OUT40_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT41 (IC 1) */
#define R187_FTDM_OUT41_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R187_FTDM_OUT41_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R187_FTDM_OUT41_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R187_FTDM_OUT41_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R187_FTDM_OUT41_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R187_FTDM_OUT41_BYTE_OUT_POS_IC_1_MASK    0x3
#define R187_FTDM_OUT41_BYTE_OUT_POS_IC_1_SHIFT   0
#define R187_FTDM_OUT41_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R187_FTDM_OUT41_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R187_FTDM_OUT41_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R187_FTDM_OUT41_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R187_FTDM_OUT41_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R187_FTDM_OUT41_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R187_FTDM_OUT41_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R187_FTDM_OUT41_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT42 (IC 1) */
#define R188_FTDM_OUT42_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R188_FTDM_OUT42_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R188_FTDM_OUT42_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R188_FTDM_OUT42_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R188_FTDM_OUT42_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R188_FTDM_OUT42_BYTE_OUT_POS_IC_1_MASK    0x3
#define R188_FTDM_OUT42_BYTE_OUT_POS_IC_1_SHIFT   0
#define R188_FTDM_OUT42_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R188_FTDM_OUT42_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R188_FTDM_OUT42_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R188_FTDM_OUT42_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R188_FTDM_OUT42_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R188_FTDM_OUT42_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R188_FTDM_OUT42_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R188_FTDM_OUT42_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT43 (IC 1) */
#define R189_FTDM_OUT43_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R189_FTDM_OUT43_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R189_FTDM_OUT43_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R189_FTDM_OUT43_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R189_FTDM_OUT43_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R189_FTDM_OUT43_BYTE_OUT_POS_IC_1_MASK    0x3
#define R189_FTDM_OUT43_BYTE_OUT_POS_IC_1_SHIFT   0
#define R189_FTDM_OUT43_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R189_FTDM_OUT43_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R189_FTDM_OUT43_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R189_FTDM_OUT43_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R189_FTDM_OUT43_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R189_FTDM_OUT43_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R189_FTDM_OUT43_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R189_FTDM_OUT43_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT44 (IC 1) */
#define R190_FTDM_OUT44_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R190_FTDM_OUT44_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R190_FTDM_OUT44_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R190_FTDM_OUT44_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R190_FTDM_OUT44_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R190_FTDM_OUT44_BYTE_OUT_POS_IC_1_MASK    0x3
#define R190_FTDM_OUT44_BYTE_OUT_POS_IC_1_SHIFT   0
#define R190_FTDM_OUT44_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R190_FTDM_OUT44_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R190_FTDM_OUT44_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R190_FTDM_OUT44_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R190_FTDM_OUT44_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R190_FTDM_OUT44_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R190_FTDM_OUT44_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R190_FTDM_OUT44_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT45 (IC 1) */
#define R191_FTDM_OUT45_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R191_FTDM_OUT45_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R191_FTDM_OUT45_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R191_FTDM_OUT45_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R191_FTDM_OUT45_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R191_FTDM_OUT45_BYTE_OUT_POS_IC_1_MASK    0x3
#define R191_FTDM_OUT45_BYTE_OUT_POS_IC_1_SHIFT   0
#define R191_FTDM_OUT45_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R191_FTDM_OUT45_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R191_FTDM_OUT45_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R191_FTDM_OUT45_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R191_FTDM_OUT45_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R191_FTDM_OUT45_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R191_FTDM_OUT45_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R191_FTDM_OUT45_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT46 (IC 1) */
#define R192_FTDM_OUT46_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R192_FTDM_OUT46_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R192_FTDM_OUT46_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R192_FTDM_OUT46_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R192_FTDM_OUT46_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R192_FTDM_OUT46_BYTE_OUT_POS_IC_1_MASK    0x3
#define R192_FTDM_OUT46_BYTE_OUT_POS_IC_1_SHIFT   0
#define R192_FTDM_OUT46_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R192_FTDM_OUT46_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R192_FTDM_OUT46_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R192_FTDM_OUT46_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R192_FTDM_OUT46_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R192_FTDM_OUT46_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R192_FTDM_OUT46_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R192_FTDM_OUT46_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT47 (IC 1) */
#define R193_FTDM_OUT47_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R193_FTDM_OUT47_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R193_FTDM_OUT47_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R193_FTDM_OUT47_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R193_FTDM_OUT47_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R193_FTDM_OUT47_BYTE_OUT_POS_IC_1_MASK    0x3
#define R193_FTDM_OUT47_BYTE_OUT_POS_IC_1_SHIFT   0
#define R193_FTDM_OUT47_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R193_FTDM_OUT47_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R193_FTDM_OUT47_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R193_FTDM_OUT47_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R193_FTDM_OUT47_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R193_FTDM_OUT47_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R193_FTDM_OUT47_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R193_FTDM_OUT47_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT48 (IC 1) */
#define R194_FTDM_OUT48_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R194_FTDM_OUT48_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R194_FTDM_OUT48_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R194_FTDM_OUT48_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R194_FTDM_OUT48_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R194_FTDM_OUT48_BYTE_OUT_POS_IC_1_MASK    0x3
#define R194_FTDM_OUT48_BYTE_OUT_POS_IC_1_SHIFT   0
#define R194_FTDM_OUT48_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R194_FTDM_OUT48_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R194_FTDM_OUT48_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R194_FTDM_OUT48_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R194_FTDM_OUT48_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R194_FTDM_OUT48_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R194_FTDM_OUT48_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R194_FTDM_OUT48_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT49 (IC 1) */
#define R195_FTDM_OUT49_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R195_FTDM_OUT49_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R195_FTDM_OUT49_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R195_FTDM_OUT49_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R195_FTDM_OUT49_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R195_FTDM_OUT49_BYTE_OUT_POS_IC_1_MASK    0x3
#define R195_FTDM_OUT49_BYTE_OUT_POS_IC_1_SHIFT   0
#define R195_FTDM_OUT49_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R195_FTDM_OUT49_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R195_FTDM_OUT49_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R195_FTDM_OUT49_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R195_FTDM_OUT49_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R195_FTDM_OUT49_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R195_FTDM_OUT49_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R195_FTDM_OUT49_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT50 (IC 1) */
#define R196_FTDM_OUT50_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R196_FTDM_OUT50_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R196_FTDM_OUT50_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R196_FTDM_OUT50_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R196_FTDM_OUT50_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R196_FTDM_OUT50_BYTE_OUT_POS_IC_1_MASK    0x3
#define R196_FTDM_OUT50_BYTE_OUT_POS_IC_1_SHIFT   0
#define R196_FTDM_OUT50_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R196_FTDM_OUT50_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R196_FTDM_OUT50_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R196_FTDM_OUT50_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R196_FTDM_OUT50_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R196_FTDM_OUT50_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R196_FTDM_OUT50_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R196_FTDM_OUT50_SLOT_ENABLE_OUT_IC_1_SHIFT 7

/* FTDM_OUT51 (IC 1) */
#define R197_FTDM_OUT51_BYTE_OUT_POS_IC_1         0x0    /* 00b	[1:0] */
#define R197_FTDM_OUT51_CHANNEL_OUT_POS_IC_1      0x0    /* 000b	[4:2] */
#define R197_FTDM_OUT51_SERIAL_OUT_SEL_IC_1       0x0    /* 0b	[5] */
#define R197_FTDM_OUT51_REVERSE_OUT_BYTE_IC_1     0x0    /* 0b	[6] */
#define R197_FTDM_OUT51_SLOT_ENABLE_OUT_IC_1      0x0    /* 0b	[7] */
#define R197_FTDM_OUT51_BYTE_OUT_POS_IC_1_MASK    0x3
#define R197_FTDM_OUT51_BYTE_OUT_POS_IC_1_SHIFT   0
#define R197_FTDM_OUT51_CHANNEL_OUT_POS_IC_1_MASK 0x1C
#define R197_FTDM_OUT51_CHANNEL_OUT_POS_IC_1_SHIFT 2
#define R197_FTDM_OUT51_SERIAL_OUT_SEL_IC_1_MASK  0x20
#define R197_FTDM_OUT51_SERIAL_OUT_SEL_IC_1_SHIFT 5
#define R197_FTDM_OUT51_REVERSE_OUT_BYTE_IC_1_MASK 0x40
#define R197_FTDM_OUT51_REVERSE_OUT_BYTE_IC_1_SHIFT 6
#define R197_FTDM_OUT51_SLOT_ENABLE_OUT_IC_1_MASK 0x80
#define R197_FTDM_OUT51_SLOT_ENABLE_OUT_IC_1_SHIFT 7

