LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* ASRC6_RAMPMAX (IC 1) */
#define R307_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R307_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R307_ASRC6_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ASRC7_RAMPMAX (IC 1) */
#define R308_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1     0x7FF  /* 11111111111b	[10:0] */
#define R308_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1_MASK 0x7FF
#define R308_ASRC7_RAMPMAX_RAMPMAX_VALUE_IC_1_SHIFT 0

/* ADC_READ0 (IC 1) */
#define R309_ADC_READ0_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R309_ADC_READ0_ADC_VALUE_IC_1_MASK        0xFFFF
#define R309_ADC_READ0_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ1 (IC 1) */
#define R310_ADC_READ1_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R310_ADC_READ1_ADC_VALUE_IC_1_MASK        0xFFFF
#define R310_ADC_READ1_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ2 (IC 1) */
#define R311_ADC_READ2_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R311_ADC_READ2_ADC_VALUE_IC_1_MASK        0xFFFF
#define R311_ADC_READ2_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ3 (IC 1) */
#define R312_ADC_READ3_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R312_ADC_READ3_ADC_VALUE_IC_1_MASK        0xFFFF
#define R312_ADC_READ3_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ4 (IC 1) */
#define R313_ADC_READ4_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R313_ADC_READ4_ADC_VALUE_IC_1_MASK        0xFFFF
#define R313_ADC_READ4_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ5 (IC 1) */
#define R314_ADC_READ5_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R314_ADC_READ5_ADC_VALUE_IC_1_MASK        0xFFFF
#define R314_ADC_READ5_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ6 (IC 1) */
#define R315_ADC_READ6_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R315_ADC_READ6_ADC_VALUE_IC_1_MASK        0xFFFF
#define R315_ADC_READ6_ADC_VALUE_IC_1_SHIFT       0

/* ADC_READ7 (IC 1) */
#define R316_ADC_READ7_ADC_VALUE_IC_1             0x0000 /* 0000000000000000b	[15:0] */
#define R316_ADC_READ7_ADC_VALUE_IC_1_MASK        0xFFFF
#define R316_ADC_READ7_ADC_VALUE_IC_1_SHIFT       0

/* MP0_MODE1 (IC 1) */
#define R317_MP0_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R317_MP0_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R317_MP0_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R317_MP0_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R317_MP0_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R317_MP0_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R317_MP0_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R317_MP0_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R317_MP0_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R317_MP0_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R317_MP0_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R317_MP0_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP1_MODE1 (IC 1) */
#define R318_MP1_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R318_MP1_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R318_MP1_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R318_MP1_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R318_MP1_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R318_MP1_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R318_MP1_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R318_MP1_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R318_MP1_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R318_MP1_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R318_MP1_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R318_MP1_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP2_MODE1 (IC 1) */
#define R319_MP2_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R319_MP2_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R319_MP2_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R319_MP2_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R319_MP2_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R319_MP2_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R319_MP2_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R319_MP2_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R319_MP2_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R319_MP2_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R319_MP2_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R319_MP2_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP3_MODE1 (IC 1) */
#define R320_MP3_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R320_MP3_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R320_MP3_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R320_MP3_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R320_MP3_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R320_MP3_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R320_MP3_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R320_MP3_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R320_MP3_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R320_MP3_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R320_MP3_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R320_MP3_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP4_MODE1 (IC 1) */
#define R321_MP4_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R321_MP4_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R321_MP4_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R321_MP4_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R321_MP4_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R321_MP4_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R321_MP4_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R321_MP4_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R321_MP4_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R321_MP4_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R321_MP4_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R321_MP4_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP5_MODE1 (IC 1) */
#define R322_MP5_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R322_MP5_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R322_MP5_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R322_MP5_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R322_MP5_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R322_MP5_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R322_MP5_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R322_MP5_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R322_MP5_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R322_MP5_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R322_MP5_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R322_MP5_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP6_MODE1 (IC 1) */
#define R323_MP6_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R323_MP6_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R323_MP6_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R323_MP6_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R323_MP6_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R323_MP6_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R323_MP6_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R323_MP6_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R323_MP6_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R323_MP6_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R323_MP6_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R323_MP6_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP7_MODE1 (IC 1) */
#define R324_MP7_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R324_MP7_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R324_MP7_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R324_MP7_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R324_MP7_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R324_MP7_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R324_MP7_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R324_MP7_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R324_MP7_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R324_MP7_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R324_MP7_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R324_MP7_MODE1_SS_SELECT1_IC_1_SHIFT      8

