LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* MP8_MODE1 (IC 1) */
#define R325_MP8_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R325_MP8_MODE1_MP_MODE1_IC_1              0x0    /* 000b	[3:1] */
#define R325_MP8_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R325_MP8_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R325_MP8_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R325_MP8_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R325_MP8_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R325_MP8_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R325_MP8_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R325_MP8_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R325_MP8_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R325_MP8_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP9_MODE1 (IC 1) */
#define R326_MP9_MODE1_MP_ENABLE1_IC_1            0x0    /* 0b	[0] */
#define R326_MP9_MODE1_MP_MODE1_IC_1              0x2    /* 010b	[3:1] */
#define R326_MP9_MODE1_DEBOUNCE_VALUE1_IC_1       0x0    /* 0000b	[7:4] */
#define R326_MP9_MODE1_SS_SELECT1_IC_1            0x0    /* 000b	[10:8] */
#define R326_MP9_MODE1_MP_ENABLE1_IC_1_MASK       0x1
#define R326_MP9_MODE1_MP_ENABLE1_IC_1_SHIFT      0
#define R326_MP9_MODE1_MP_MODE1_IC_1_MASK         0xE
#define R326_MP9_MODE1_MP_MODE1_IC_1_SHIFT        1
#define R326_MP9_MODE1_DEBOUNCE_VALUE1_IC_1_MASK  0xF0
#define R326_MP9_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R326_MP9_MODE1_SS_SELECT1_IC_1_MASK       0x700
#define R326_MP9_MODE1_SS_SELECT1_IC_1_SHIFT      8

/* MP10_MODE1 (IC 1) */
#define R327_MP10_MODE1_MP_ENABLE1_IC_1           0x0    /* 0b	[0] */
#define R327_MP10_MODE1_MP_MODE1_IC_1             0x0    /* 000b	[3:1] */
#define R327_MP10_MODE1_DEBOUNCE_VALUE1_IC_1      0x0    /* 0000b	[7:4] */
#define R327_MP10_MODE1_SS_SELECT1_IC_1           0x0    /* 000b	[10:8] */
#define R327_MP10_MODE1_MP_ENABLE1_IC_1_MASK      0x1
#define R327_MP10_MODE1_MP_ENABLE1_IC_1_SHIFT     0
#define R327_MP10_MODE1_MP_MODE1_IC_1_MASK        0xE
#define R327_MP10_MODE1_MP_MODE1_IC_1_SHIFT       1
#define R327_MP10_MODE1_DEBOUNCE_VALUE1_IC_1_MASK 0xF0
#define R327_MP10_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R327_MP10_MODE1_SS_SELECT1_IC_1_MASK      0x700
#define R327_MP10_MODE1_SS_SELECT1_IC_1_SHIFT     8

/* MP11_MODE1 (IC 1) */
#define R328_MP11_MODE1_MP_ENABLE1_IC_1           0x0    /* 0b	[0] */
#define R328_MP11_MODE1_MP_MODE1_IC_1             0x0    /* 000b	[3:1] */
#define R328_MP11_MODE1_DEBOUNCE_VALUE1_IC_1      0x0    /* 0000b	[7:4] */
#define R328_MP11_MODE1_SS_SELECT1_IC_1           0x0    /* 000b	[10:8] */
#define R328_MP11_MODE1_MP_ENABLE1_IC_1_MASK      0x1
#define R328_MP11_MODE1_MP_ENABLE1_IC_1_SHIFT     0
#define R328_MP11_MODE1_MP_MODE1_IC_1_MASK        0xE
#define R328_MP11_MODE1_MP_MODE1_IC_1_SHIFT       1
#define R328_MP11_MODE1_DEBOUNCE_VALUE1_IC_1_MASK 0xF0
#define R328_MP11_MODE1_DEBOUNCE_VALUE1_IC_1_SHIFT 4
#define R328_MP11_MODE1_SS_SELECT1_IC_1_MASK      0x700
#define R328_MP11_MODE1_SS_SELECT1_IC_1_SHIFT     8

/* MP0_WRITE1 (IC 1) */
#define R329_MP0_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R329_MP0_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R329_MP0_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP1_WRITE1 (IC 1) */
#define R330_MP1_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R330_MP1_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R330_MP1_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP2_WRITE1 (IC 1) */
#define R331_MP2_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R331_MP2_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R331_MP2_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP3_WRITE1 (IC 1) */
#define R332_MP3_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R332_MP3_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R332_MP3_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP4_WRITE1 (IC 1) */
#define R333_MP4_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R333_MP4_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R333_MP4_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP5_WRITE1 (IC 1) */
#define R334_MP5_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R334_MP5_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R334_MP5_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP6_WRITE1 (IC 1) */
#define R335_MP6_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R335_MP6_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R335_MP6_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP7_WRITE1 (IC 1) */
#define R336_MP7_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R336_MP7_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R336_MP7_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP8_WRITE1 (IC 1) */
#define R337_MP8_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R337_MP8_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R337_MP8_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP9_WRITE1 (IC 1) */
#define R338_MP9_WRITE1_MP_REG_WRITE1_IC_1        0x0    /* 0b	[0] */
#define R338_MP9_WRITE1_MP_REG_WRITE1_IC_1_MASK   0x1
#define R338_MP9_WRITE1_MP_REG_WRITE1_IC_1_SHIFT  0

/* MP10_WRITE1 (IC 1) */
#define R339_MP10_WRITE1_MP_REG_WRITE1_IC_1       0x0    /* 0b	[0] */
#define R339_MP10_WRITE1_MP_REG_WRITE1_IC_1_MASK  0x1
#define R339_MP10_WRITE1_MP_REG_WRITE1_IC_1_SHIFT 0

/* MP11_WRITE1 (IC 1) */
#define R340_MP11_WRITE1_MP_REG_WRITE1_IC_1       0x0    /* 0b	[0] */
#define R340_MP11_WRITE1_MP_REG_WRITE1_IC_1_MASK  0x1
#define R340_MP11_WRITE1_MP_REG_WRITE1_IC_1_SHIFT 0

/* MP0_READ1 (IC 1) */
#define R341_MP0_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R341_MP0_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R341_MP0_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP1_READ1 (IC 1) */
#define R342_MP1_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R342_MP1_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R342_MP1_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP2_READ1 (IC 1) */
#define R343_MP2_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R343_MP2_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R343_MP2_READ1_MP_REG_READ1_IC_1_SHIFT    0

/* MP3_READ1 (IC 1) */
#define R344_MP3_READ1_MP_REG_READ1_IC_1          0x0    /* 0b	[0] */
#define R344_MP3_READ1_MP_REG_READ1_IC_1_MASK     0x1
#define R344_MP3_READ1_MP_REG_READ1_IC_1_SHIFT    0

