LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* SPDIF_RX_VB_LEFT_6 (IC 1) */
#define R418_SPDIF_RX_VB_LEFT_6_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R418_SPDIF_RX_VB_LEFT_6_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R418_SPDIF_RX_VB_LEFT_6_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_7 (IC 1) */
#define R419_SPDIF_RX_VB_LEFT_7_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R419_SPDIF_RX_VB_LEFT_7_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R419_SPDIF_RX_VB_LEFT_7_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_8 (IC 1) */
#define R420_SPDIF_RX_VB_LEFT_8_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R420_SPDIF_RX_VB_LEFT_8_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R420_SPDIF_RX_VB_LEFT_8_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_9 (IC 1) */
#define R421_SPDIF_RX_VB_LEFT_9_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R421_SPDIF_RX_VB_LEFT_9_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R421_SPDIF_RX_VB_LEFT_9_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_10 (IC 1) */
#define R422_SPDIF_RX_VB_LEFT_10_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R422_SPDIF_RX_VB_LEFT_10_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R422_SPDIF_RX_VB_LEFT_10_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_LEFT_11 (IC 1) */
#define R423_SPDIF_RX_VB_LEFT_11_SPDIF_RX_VB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R423_SPDIF_RX_VB_LEFT_11_SPDIF_RX_VB_LEFT_IC_1_MASK 0xFFFF
#define R423_SPDIF_RX_VB_LEFT_11_SPDIF_RX_VB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_0 (IC 1) */
#define R424_SPDIF_RX_VB_RIGHT_0_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R424_SPDIF_RX_VB_RIGHT_0_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R424_SPDIF_RX_VB_RIGHT_0_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_1 (IC 1) */
#define R425_SPDIF_RX_VB_RIGHT_1_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R425_SPDIF_RX_VB_RIGHT_1_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R425_SPDIF_RX_VB_RIGHT_1_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_2 (IC 1) */
#define R426_SPDIF_RX_VB_RIGHT_2_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R426_SPDIF_RX_VB_RIGHT_2_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R426_SPDIF_RX_VB_RIGHT_2_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_3 (IC 1) */
#define R427_SPDIF_RX_VB_RIGHT_3_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R427_SPDIF_RX_VB_RIGHT_3_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R427_SPDIF_RX_VB_RIGHT_3_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_4 (IC 1) */
#define R428_SPDIF_RX_VB_RIGHT_4_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R428_SPDIF_RX_VB_RIGHT_4_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R428_SPDIF_RX_VB_RIGHT_4_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_5 (IC 1) */
#define R429_SPDIF_RX_VB_RIGHT_5_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R429_SPDIF_RX_VB_RIGHT_5_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R429_SPDIF_RX_VB_RIGHT_5_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_6 (IC 1) */
#define R430_SPDIF_RX_VB_RIGHT_6_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R430_SPDIF_RX_VB_RIGHT_6_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R430_SPDIF_RX_VB_RIGHT_6_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_7 (IC 1) */
#define R431_SPDIF_RX_VB_RIGHT_7_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R431_SPDIF_RX_VB_RIGHT_7_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R431_SPDIF_RX_VB_RIGHT_7_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_8 (IC 1) */
#define R432_SPDIF_RX_VB_RIGHT_8_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R432_SPDIF_RX_VB_RIGHT_8_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R432_SPDIF_RX_VB_RIGHT_8_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_9 (IC 1) */
#define R433_SPDIF_RX_VB_RIGHT_9_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R433_SPDIF_RX_VB_RIGHT_9_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R433_SPDIF_RX_VB_RIGHT_9_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_10 (IC 1) */
#define R434_SPDIF_RX_VB_RIGHT_10_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R434_SPDIF_RX_VB_RIGHT_10_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R434_SPDIF_RX_VB_RIGHT_10_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_VB_RIGHT_11 (IC 1) */
#define R435_SPDIF_RX_VB_RIGHT_11_SPDIF_RX_VB_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R435_SPDIF_RX_VB_RIGHT_11_SPDIF_RX_VB_RIGHT_IC_1_MASK 0xFFFF
#define R435_SPDIF_RX_VB_RIGHT_11_SPDIF_RX_VB_RIGHT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_0 (IC 1) */
#define R436_SPDIF_RX_PB_LEFT_0_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R436_SPDIF_RX_PB_LEFT_0_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R436_SPDIF_RX_PB_LEFT_0_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_1 (IC 1) */
#define R437_SPDIF_RX_PB_LEFT_1_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R437_SPDIF_RX_PB_LEFT_1_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R437_SPDIF_RX_PB_LEFT_1_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_2 (IC 1) */
#define R438_SPDIF_RX_PB_LEFT_2_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R438_SPDIF_RX_PB_LEFT_2_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R438_SPDIF_RX_PB_LEFT_2_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_3 (IC 1) */
#define R439_SPDIF_RX_PB_LEFT_3_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R439_SPDIF_RX_PB_LEFT_3_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R439_SPDIF_RX_PB_LEFT_3_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_4 (IC 1) */
#define R440_SPDIF_RX_PB_LEFT_4_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R440_SPDIF_RX_PB_LEFT_4_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R440_SPDIF_RX_PB_LEFT_4_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_5 (IC 1) */
#define R441_SPDIF_RX_PB_LEFT_5_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R441_SPDIF_RX_PB_LEFT_5_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R441_SPDIF_RX_PB_LEFT_5_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_6 (IC 1) */
#define R442_SPDIF_RX_PB_LEFT_6_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R442_SPDIF_RX_PB_LEFT_6_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R442_SPDIF_RX_PB_LEFT_6_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_7 (IC 1) */
#define R443_SPDIF_RX_PB_LEFT_7_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R443_SPDIF_RX_PB_LEFT_7_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R443_SPDIF_RX_PB_LEFT_7_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_8 (IC 1) */
#define R444_SPDIF_RX_PB_LEFT_8_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R444_SPDIF_RX_PB_LEFT_8_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R444_SPDIF_RX_PB_LEFT_8_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

/* SPDIF_RX_PB_LEFT_9 (IC 1) */
#define R445_SPDIF_RX_PB_LEFT_9_SPDIF_RX_PB_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R445_SPDIF_RX_PB_LEFT_9_SPDIF_RX_PB_LEFT_IC_1_MASK 0xFFFF
#define R445_SPDIF_RX_PB_LEFT_9_SPDIF_RX_PB_LEFT_IC_1_SHIFT 0

