LeanderGlanda/Endstufe/Endstufe_v2/Software/RP2040/src/dsp/SigmaStudioOutput/systemfiles_IC_1_REG.h
/* SPDIF_TX_CS_RIGHT_0 (IC 1) */
#define R475_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R475_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R475_SPDIF_TX_CS_RIGHT_0_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_1 (IC 1) */
#define R476_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R476_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R476_SPDIF_TX_CS_RIGHT_1_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_2 (IC 1) */
#define R477_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R477_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R477_SPDIF_TX_CS_RIGHT_2_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_3 (IC 1) */
#define R478_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R478_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R478_SPDIF_TX_CS_RIGHT_3_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_4 (IC 1) */
#define R479_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R479_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R479_SPDIF_TX_CS_RIGHT_4_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_5 (IC 1) */
#define R480_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R480_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R480_SPDIF_TX_CS_RIGHT_5_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_6 (IC 1) */
#define R481_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R481_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R481_SPDIF_TX_CS_RIGHT_6_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_7 (IC 1) */
#define R482_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R482_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R482_SPDIF_TX_CS_RIGHT_7_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_8 (IC 1) */
#define R483_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R483_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R483_SPDIF_TX_CS_RIGHT_8_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_9 (IC 1) */
#define R484_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R484_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R484_SPDIF_TX_CS_RIGHT_9_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_10 (IC 1) */
#define R485_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R485_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R485_SPDIF_TX_CS_RIGHT_10_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_CS_RIGHT_11 (IC 1) */
#define R486_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R486_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1_MASK 0xFFFF
#define R486_SPDIF_TX_CS_RIGHT_11_SPDIF_TX_CS_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_0 (IC 1) */
#define R487_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R487_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R487_SPDIF_TX_UD_LEFT_0_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_1 (IC 1) */
#define R488_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R488_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R488_SPDIF_TX_UD_LEFT_1_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_2 (IC 1) */
#define R489_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R489_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R489_SPDIF_TX_UD_LEFT_2_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_3 (IC 1) */
#define R490_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R490_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R490_SPDIF_TX_UD_LEFT_3_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_4 (IC 1) */
#define R491_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R491_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R491_SPDIF_TX_UD_LEFT_4_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_5 (IC 1) */
#define R492_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R492_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R492_SPDIF_TX_UD_LEFT_5_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_6 (IC 1) */
#define R493_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R493_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R493_SPDIF_TX_UD_LEFT_6_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_7 (IC 1) */
#define R494_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R494_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R494_SPDIF_TX_UD_LEFT_7_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_8 (IC 1) */
#define R495_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R495_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R495_SPDIF_TX_UD_LEFT_8_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_9 (IC 1) */
#define R496_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R496_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R496_SPDIF_TX_UD_LEFT_9_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_10 (IC 1) */
#define R497_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R497_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R497_SPDIF_TX_UD_LEFT_10_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_LEFT_11 (IC 1) */
#define R498_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R498_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1_MASK 0xFFFF
#define R498_SPDIF_TX_UD_LEFT_11_SPDIF_TX_UD_LEFT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_0 (IC 1) */
#define R499_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R499_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R499_SPDIF_TX_UD_RIGHT_0_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

/* SPDIF_TX_UD_RIGHT_1 (IC 1) */
#define R500_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1 0x0000 /* 0000000000000000b	[15:0] */
#define R500_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1_MASK 0xFFFF
#define R500_SPDIF_TX_UD_RIGHT_1_SPDIF_TX_UD_RIGHT_IC_1_SHIFT 0

